//
// Created by ema on 8.10.24.
//
#include <iostream>
using namespace std;

int main() {
    // Задача 3
    // Да се напише програма која за дадени страни на еден разностран триаголник ќе ги отпечати на екран периметарот и квадратот од плоштината (нека се работи со a = 5, b = 7.5, c = 10.2).

    // float a = 5, b = 7.5, c = 10.2;
    // float L;
    // L = a + b + c;
    // cout << "Perimetarot e: " << L << endl;
    // float s;
    // s = L / 2.0;
    // float P = s * (s - a) * (s - b) * (s - c);
    // cout << "Plostinata e: " << P << endl;

    // Задача 4
    // Да се напише програма за пресметување на аритметичката средина на броевите 3, 5 и 12.

    // int a=5, b=3, c=12;
    // float ar;
    // ar = (a+b+c)/3.0;
    // cout << ar << endl;

    // Задача 5
    // Да се напише програма која ќе ги отпечати на екран остатоците при делењето на бројот 19 со 2, 3, 5 и 8.

    // Задача 6
    // Да се напише програма за пресметување и печатење на плоштината и периметарот на круг. Радиусот на кругот се чита од стандарден влез (тастатура) како децимален број.
    // float r;
    // cin >> r;
    // float L = 2*3.14*r;
    // float P = r*r*3.14;
    // cout << "P = " << P << endl;
    // cout << "L = " << L << endl;

    // Задача 8
    // Да се напише програма која чита голема буква од стандарден влез и ја печати истата како мала буква. - Напомена: Секој знак се претставува со ASCII број.
    // char c;
    // cin>>c;
    // //c = c + 32;
    // c = c - 32;
    // cout<<c;

    // Задача 9
    // Да се напише програма каде од тастатура ќе се внесе цена на производ, а потоа ќе ја испечати неговата цена со пресметан ддв.

    // int cena;
    // cin>>cena;
    // cout<<"Cena so DDV:"<<cena * 1.18;

    // Задача 11
    // Да се напише програма каде од тастатура ќе се внесе трицифрен цел број. Програмата ќе ја испечати најзначајната и најмалку значајната цифра од бројот
    int  a;
    cin>>a;
    cout<<"Najznacajnata cifra e:"<<a/100<<endl;
    cout<<"Najmalku znacajna cifra e: "<<a%10<<endl;
}