// //
// // Created by ema on 9.11.24.
// //

#include <iostream>

    using namespace std;

// Lanski labs kviz zadaca 32
// Среден број е број кај кој секоја следна цифра е помала на претходната (гледајќи од најзначајната кон најмалку значајната). На пример, 7421. Едноцифрените броеви не се средни броеви.
// Да се напише програма во која прво се внесува број N кој го определува вкупниот број на броеви кои ќе бидат внесени од тастатура. Потоа се внесуваат N-те броеви, еден по еден.
// На излез, потребно е да се испечатат сите броеви кои го исполнуваат условот за среден број, а потоа да се отпечати и минималниот среден број од внесените броеви.
// Доколку не постои број кој го задоволува условот се печати вредност -1.
// Пример за влез:
// 5
// 435
// 643
// 12234
// 721
// 7720
//
// Пример за излез:
// 643
// 721
// 643

int main() {
    int n;
    cin>>n;
    int num, i, temp, min=99999;
    int flag = 1;
    for(i=0; i<n; i++) {
        cin>>num;
        temp=num;
        while(temp>=10) {
            if(temp%10>=temp%100/10) {
                flag=0;
                break;
            }
            temp/=10;
        }
        if(temp<10) {
            cout<<num<<endl;
            if(min>num) {
                min=num;
            }
        }

    }
    if(min==99999) {
        cout<<"-1"<<endl;
    }
    else {
        cout<<min<<endl;
    }



}