//
// Created by ema on 9.11.24.
//

#include <iostream>
using namespace std;

// Да се напише програма со која се внесува цел број n (n>0) а потоа ја пресметува сумата на серијата (n*n) + …+ (3*3) + (2*2) + (1*1) но САМО за парните членови.
// На излезот се отпечатуваат парните членови, сумата и средната вредност на добиената серија од парните членови. Излезот е во дадениот формат
// (секој парен член, сумата и средната вредност во нови редови, нема празни места).
// TERMIN 1 ZADACA 1
int main() {

    int n;
    cin>>n;
    int sum=0;
    int count=0;
    for(int i=n; i>=1; i--) {
        int proizvod = 1;
        if(i%2!=0) {
            proizvod = i*i;
            sum+=proizvod;
            count++;
            cout<<i<<"*"<<i<<"="<<proizvod<<endl;
        }
    }
    cout<<sum<<endl;
    cout<<(float)sum/(float)count<<endl;
}

//Да се напише програма со која се внесува цел број n (n>0) а потоа ја пресметува сумата на серијата (n*n) + …+ (3*3) + (2*2) + (1*1), но САМО за НЕпарните членови.
//На излезот се отпечатуваат само непарните членови, сумата и средната вредност на добиената серија од непарните членови.
//Излезот е во дадениот формат (секој непарен член, сумата и средната вредност во нови редови, нема празни места).