#include <iostream>
#include <cstring>
using namespace std;

// Од стандарден влез се внесува цел број N (N<=100), а потоа се внесуваат N текстуални низи (реченици) со максимална должина од 100 знаци, секоја зададена во нов ред.
// За секоја од внесените реченици треба да се изброи колку вкупно пати последователно се појавуваат самогласки
//  На крај да се генерира извештај во кој ќе се наведе колку вкупно реченици имаат
// 0
// ,
// 1
// ,
// 2
// , …
//  односно n појaвувања на последователни самогласки
//  Во овој случај n е максималниот број на последователни појавувања на самогласки во некоја од речениците
// Излезот треба да биде во форматот како што е даден во примерот
// .
// Забелешка: Броењето
//  на последователни појавувања на самогласки во реченицата  да се направи во посебна функција
// .
// Кај излезот првиот број ги значува последователните појавувања на самогласките(0 до n),
//  а вториот број означува кај колку реченици од влезот е соодветниот број на последователни повторувања на самогласки
// .
// На пример во реченицата: Uste
//  edna nоvaаа goооооdina ni dojdeееее
// .
// бројот на последователно појавување самогласки е:
// 3
// (обележани со задебелени букви)
int samoglaska(char a) {
    a = tolower(a);
    if(a == 'a' || a == 'e' || a == 'i' || a == 'o' || a == 'u')
        return 1;
    return 0;
}
int samoglaski (char *tekst) {
    int posledovatelni=0;
    for(int i=0;tekst[i]!='\0';) {
        int counter= 0;
        if(samoglaska(tekst[i])) {
            for(int j=i; tolower(samoglaska(tekst[j])); j++) {
                counter++;
            }
            if(counter>1) {
                posledovatelni++;
            }
            i+=counter;
        }
        else i++;



    }
    return posledovatelni;
}
int main() {
int n;
    cin>>n;
    cin.ignore();
    char str[100];
    int count[100];
    int max_pojavi=0;
    for(int i=0;i<n;i++) {
        cin.getline(str,100);
        if(samoglaski(str)>max_pojavi) {
            max_pojavi = samoglaski(str);
        }
        count[samoglaski(str)]++;
    }
    for(int i=0;i<=max_pojavi;i++) {
        cout<<i<<": "<<count[i]<<endl;
    }

}


