//
// Created by ema on 15.10.24.
//

#include <iostream>
using namespace std;

// Да се напише програма за пресметување на возраста на едно куче во човечки години. Кучешката возраст се чита од стандарден влез.
// Доколку се внесе негативен број за возраста, да се испечати следната порака: “ Vozrasta
//  mora da bide pozitiven broj”
// .
//
// Забелешка: За
// првите две години, една кучешка година е еднаква на
// 10
// ,
// 5
// човечки години
// .
// После тоа, секоја кучешка година е еднаква на
// 4
// човечки години
// .
int main() {
float kg, cg;
    cin>>kg;
    if(kg>0) {
        if(kg<=2) {
            cg = kg * 10.5;
        }
        else {
            cg = 2 * 10.5 + (kg-2) * 4;
        }
        cout<<cg;
    }
    else {
        cout<<"Nepravilen vnes na godini"<<endl;
    }
}
